x = [4.2,4.15,4.14,4.12,4.1,4.08,4.05,4.03,3.97,3.93,3.9,3.87,3.84,3.81,3.79,3.77,3.76,3.76,3.74,3.73,3.72,3.71,3.69,3.66,3.65,3.64,3.63,3.61,3.59];
y=[100,99,97,95,92,90,87,85,80,75,70,65,60,55,50,45,42,40,35,30,25,20,15,12,10,8,5,3,1];
x = x*3;
%[xData, yData] = prepareCurveData( x, y );
x_span = linspace(10.77,12.6,100);
fitresult = 36.7704*x_span.^4-1722.6416*x_span.^3+30209.6946*x_span.^2-234978.7374*x_span+683887.8996;

% 绘制数据拟合图。
figure( 'Name', '电池电量' );
h = plot( x, y );
hold on
plot(x_span,fitresult)
legend( '涓流表', '拟合结果' );
% 为坐标区加标签
xlabel( 'x', 'Interpreter', 'none' );
ylabel( 'y', 'Interpreter', 'none' );
grid on